print(abs(-7))      # 絕對值
print(max(456, 49156, 41, 561, 4, 16, 1, 61, 419))       # 最大值
print(min(456, 49156, 41, 561, 4, 16, 1, 61, 419))       # 最小值
print(pow(3, 4))     # x的y次方

print(round(123456.789, 2))         # 四捨五入到小數點後第二位
print(round(123456.789, 1))
print(round(123456.789, 0))
print(round(123456.789, -1))        # 可用負值
print(int(round(123456.789, 0)))    # 轉整數去掉小數點跟後面的0
print(round(5.6))                   # 只輸入一個值就會取最接近的整數值
print(round(3.5))                   # 若有兩個相近的值就取偶數(3跟4取4)
print(round(4.5))                   # 若有兩個相近的值就取偶數(4跟5取4)
