a = 123
b = 12345.678
c = "Python"

print('/' + '%d' % a + '/')     # d = decimal
print('/' + '%5d' % a + '/')    # 5表示總共要印五個字元，不夠的話左邊會有空格
print('/' + '%2d' % a + '/')    # 指定的數字若小於數字長度，仍會完整顯示數字
print('/' + '%-5d' % a + '/')    # 改為向左靠齊(空格變到右邊)
print('/' + '%05d' % a + '/')   # 空格改補0
print('/' + '%+5d' % a + '/')    # +就是加個正符號

a = 357
print('%#x' % a)    # 加#x表示以16進位呈現
print('%#o' % a)    # 加#o表示以8進位呈現

a = 427
print('%#x' % a)    # 加#x表示以16進位呈現
print('%#X' % a)    # x大小寫都可，印出的英文字也會更著大小寫

# ----------------- 浮點數
print('%f' % b)         # 預設小數點後面有6位
print('%.2f' % b)       # 四捨五入在小數點後2位
print('%10.2f' % b)     # 原本共8位數，為了補到10位在左邊加空白
print('%-10.2f' % b)    # 原本共8位數，為了補到10位在右邊加空白
print('%e' % b)         # 也可以用科學符號表示
print('%E' % b)         # 也是預設四捨五入到小數點後第6位

# ----------------- 字串
print('%s' % c)
print('%10s' % c)
print('%-10s' % c)
print('%s%%' % c)       # 如果要印出%就加兩個%
